tutorials/lagrangian/reactingHeterogenousParcelFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
DebugSwitches
{
    MUCSheterogeneousRate   0;
}

application     reactingHeterogenousParcelFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       0.03;

functions
{
//     surfaceFieldValue1
//     {
//         type            surfaceFieldValue;
//         libs            ("libfieldFunctionObjects.so");
//         enabled         yes;
//         writeControl    writeTime;
//         log             yes;
//         writeFields     no;
//         regionType      patch;
//         name            outlet;
//         operation       weightedAverage;
//         weightField     phi;
//         fields
//         (
//             H2O
//             T
//         );
//     }
}


// ************************************************************************* //
